# SketchId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid..::..SketchId Property
Toposolid Class See Also
---
Returns id of the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId SketchId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SketchId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
```

# See Also
Toposolid Class
Autodesk.Revit.DB Namespace